0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   
    wall-fluido-serpentin
    {
        type            zeroGradient;
    }
   wall-fluido-s-lido
    {
        type            zeroGradient;
    }
wall-fluido-catalizador
    {
       type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
       type            fixedValue;
        value           uniform 0;
    }
 

}

// ************************************************************************* //
